Revit 2024 API
BuiltInFailures.ElementTypeFailures.NoDefaultType Property
 As a result of Reloading Latest, there are no types of [User Name] left. Create a new type by duplicating an existing [User Name] type in the Project Browser.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NoDefaultType { get; }
Visual Basic
Public Shared ReadOnly Property NoDefaultType As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NoDefaultType {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ElementTypeFailures Class
Autodesk.Revit.DB Namespace